design_model/src/main/resources/行为型模式/观察者模式/观察者模式.md
```mermaid
classDiagram
    class Observer ["Observer(抽象观察者)"]{
        <<Abstract>>
        +update()*
    }
    class ConcreteObserver {
        -observerState;
        +update();
    }
    note for ConcreteObserver  "observerState=subject.getState();" 
    class Subject ["Subject(抽象目标)"] {
        +attach(Observer obs);
        +detach(Observer obs);
        +notify();
    }
    note for Subject  "for(obs:observers){\nobs.update();}" 
    class ConcreteSubject ["ConcreteSubject(具体目标)"]{
        -subjectState;
        +getState();
        +setState();
    }
    ConcreteObserver --|> Observer
    ConcreteSubject --|> Subject
    ConcreteObserver --> ConcreteSubject : subject
    Subject --> Observer : observers
    note for ConcreteSubject  "return subjectState" 
```
